PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
/* SPDX-License-Identifier: BSD-2-Clause */
#include <stdint.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include "esp_eap_client.h"
#include "../../linux-esp32-s31/include/linux/esp32s31-radio-control.h"
#include "esp_bt.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_ipc.h"
#include "esp_phy_init.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_wifi.h"
#include "esp_private/wifi_os_adapter.h"
#include "esp_private/wifi.h"
#include "private/esp_coexist_adapter.h"
#include "private/esp_coexist_internal.h"
#include "esp_private/esp_modem_clock.h"
#include "esp_private/esp_clk.h"
#include "esp_rom_sys.h"
#include "soc/rtc.h"
#include "soc/rsa_reg.h"


extern void s31_linux_printf(const char *fmt, ...);
extern uint64_t s31_linux_wall_time_seconds(void);

time_t __wrap_time(time_t *result)
{
	time_t now = (time_t)s31_linux_wall_time_seconds();

	if (result)
		*result = now;
	return now;
}
const uint32_t s31_radio_fw_abi_version = 1;
extern void s31_radio_wifi_control_complete(int result);
extern void s31_radio_wifi_ap_station(const uint8_t *mac, bool joined);
extern void s31_radio_wifi_receive_aux(uint8_t interface, const uint8_t *frame,
				     uint16_t length, uint8_t channel, int8_t signal);
/* Do not use IDF's inline xPortGetCoreID() here: on RISC-V it reads mhartid,
 * a machine-mode CSR.  The radio payload runs in Linux S-mode, so obtain the
 * worker CPU through the explicit Linux bridge instead. */
extern int32_t s31_linux_current_cpu(void);
extern void s31_rtos_use_internal_stacks(void);
extern int s31_rtos_in_isr(void);
extern int s31_rtos_can_yield(void);
extern void s31_radio_wifi_rx_throttle(void);
extern void s31_radio_timing_tx_done(bool status, const uint8_t *data,
				     uint16_t length);
/* These ROM-owned pointers live in retained SRAM.  A software reset from an
 * ESP-IDF image can leave them pointing at that image's flash/data mapping;
 * the ROM registration functions intentionally keep an existing adapter. */
extern coex_adapter_funcs_t *g_coa_funcs_p;
extern wifi_osi_funcs_t *g_osi_funcs_p;
/* ESP-IDF invokes this from its SECONDARY system-init stage (priority 104),
 * before app_main() can initialize Wi-Fi.  The S-mode payload deliberately
 * does not run the generic IDF startup table, so preserve that ordering here.
 * WPA3/SAE uses the PSA key store for HMAC-SHA256 and otherwise fails while
 * deriving the password element. */
extern int32_t psa_crypto_init(void);
#define S31_RADIO_FEATURE_WIFI (1U << 0)
#define S31_RADIO_FEATURE_BLUETOOTH (1U << 1)
#ifdef S31_LINUX_SMODE
#define S31_PERIPH_WIFI_MODULE 5
/* ESP-IDF calls this from esp_rtc_init() before its system-init table.  The
 * U-Boot -> Linux path intentionally skips IDF startup, but the modem power
 * domain (in particular the BLE register aperture at 0x2010b000) still
 * depends on the PMU active-state programming performed here. */
extern void pmu_init(void);
/* Linux genpd owns HPCNNT force state after the one-time IDF PMU setup. */
extern void s31_linux_pmu_reclaim_after_radio_init(void)
	__attribute__((weak));

static int s31_radio_log_vprintf(const char *format, va_list args)
{
	char line[512];
	int length;

	length = vsnprintf(line, sizeof(line), format, args);
	if (length > 0)
		s31_linux_printf("%s", line);
	return length;
}

/* Wi-Fi and BTDM remain separate clients of one IDF coexistence core.  Keep
 * libnet80211's native esp_wifi_ipc_internal(): it packages each callback as a
 * Wi-Fi ioctl and executes it in the closed Wi-Fi task.  Running that callback
 * inline on the Linux radio worker changes both the owner task and the
 * happens-before relation with libcoexist's scheduler update. */
static unsigned int s31_radio_coex_users;
static unsigned int s31_radio_coex_bt_phases;
static unsigned int s31_radio_coex_wifi_phases;
static unsigned int s31_radio_coex_hw_sets;
static unsigned int s31_radio_coex_hw_enables;
static unsigned int s31_radio_coex_hw_disables;
static void (*s31_radio_coex_bt_phase_cb)(uint32_t event, int sched_count);
static void (*s31_radio_coex_ble_enable_cb)(void);
static void (*s31_radio_coex_ble_disable_cb)(void);

/* ESP-IDF's Bluedroid host reports A2DP state through vendor command 0xfc82.
 * The ESP32-S31 controller wrapper does not enable that optional VSC, but the
 * matching IDF coexistence closure exposes the same status-bit operation.
 * Keep the operation in the serialized radio world and let Linux provide only
 * the missing transport entry point. */
int s31_radio_coex_status(uint8_t type, uint8_t op, uint8_t status)
{
	if (type > COEX_SCHM_ST_TYPE_BT || op > 1)
		return -1;
	if (op)
		coex_schm_status_bit_set(type, status);
	else
		coex_schm_status_bit_clear(type, status);
	return 0;
}

extern int __real_coex_enable(void);
extern void __real_coex_disable(void);
extern int __real_coex_register_start_cb(int (*cb)(void));
extern int __real_coex_register_ble_cb(uint8_t type, void *callback);
extern int __real_coex_schm_process_restart(void);
extern int __real_coex_schm_register_callback(
	coex_schm_callback_type_t type, void *callback);
extern uint32_t coex_schm_status_get(uint32_t type);
extern void __real_coex_hw_timer_set(uint8_t idx, uint8_t src, uint8_t pti,
				     uint32_t latency, uint32_t periodic);
extern void __real_coex_hw_timer_enable(uint8_t idx);
extern void __real_coex_hw_timer_disable(uint8_t idx);
extern void *coexist_funcs;
extern int wifi_on_coex_start_process(void);
extern int wifi_on_coex_schm_phase_process(void);
extern void __real_esp_phy_enable(esp_phy_modem_t modem);
extern void __real_esp_phy_disable(esp_phy_modem_t modem);
extern esp_err_t __real_esp_ipc_call_blocking(uint32_t cpu_id,
					       esp_ipc_func_t func, void *arg);
/* Module payload text executes at the S-mode radio mapping, while the module
 * loader owns its generic read-only data relocation.  The IDF MPI helpers
 * address their four RSA blocks through the read-only MPI_BLOCK_BASES table;
 * in this execution mode that absolute-table relocation can resolve to low
 * memory.  The RSA aperture itself is already identity-mapped and used by
 * the unmodified HAL, so preserve the same four IDF mappings without making
 * the controller depend on the relocated table. */
static uintptr_t s31_mpi_block_base(uint32_t param)
{
	/* mpi_param_t is an int enum in ESP-IDF: X, Y, Z, M are 0..3.  Keep
	 * this local ABI scalar so the bridge does not need a second HAL header
	 * closure merely to replace the broken relocation table. */
	if (param == 0)
		return RSA_X_MEM;
	if (param == 1)
		return RSA_Y_MEM;
	if (param == 2)
		return RSA_Z_MEM;
	if (param == 3)
		return RSA_M_MEM;
	return 0;
}

void __wrap_mpi_hal_write_to_mem_block(uint32_t param, size_t offset,
					       const uint32_t *p, size_t n,
					       size_t num_words)
{
	volatile uint32_t *base = (volatile uint32_t *)(s31_mpi_block_base(param) +
							 offset);
	size_t copy_words = n < num_words ? n : num_words;
	size_t i;

