PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
	if (!base)
		return;
	for (i = 0; i < copy_words; i++)
		base[i] = p[i];
	for (; i < num_words; i++)
		base[i] = 0;
}

void __wrap_mpi_hal_write_at_offset(uint32_t param, int offset,
					    uint32_t value)
{
	volatile uint32_t *base = (volatile uint32_t *)(s31_mpi_block_base(param) +
							 offset);

	if (base)
		*base = value;
}

void __wrap_mpi_hal_write_rinv(uint32_t rinv)
{
	*(volatile uint32_t *)RSA_Z_MEM = rinv;
}

void __wrap_mpi_hal_read_result_hw_op(uint32_t *p, size_t n, size_t z_words)
{
	volatile uint32_t *base = (volatile uint32_t *)RSA_Z_MEM;
	size_t i;

	while (*(volatile uint32_t *)RSA_QUERY_IDLE_REG == 0)
		;
	*(volatile uint32_t *)RSA_INT_CLR_REG = 1;
	for (i = 0; i < z_words; i++)
		p[i] = base[i];
	for (; i < n; i++)
		p[i] = 0;
}

/* ESP-IDF's dual-core controller setup asks esp_ipc to run the interrupt
 * allocator on the controller's pinned core.  The Linux bridge already runs
 * radio-init on that core, so relaying this same-core request through an IDF
 * ipc task adds a scheduling boundary but no hardware ordering.  More
 * importantly, an IDF ipc task assumes a native FreeRTOS scheduler on both
 * harts; the compatibility layer serializes payload entry behind one gate.
 * Execute only the provably same-core case inline.  Cross-core users retain
 * the original IDF implementation until their executor contract is bridged. */
esp_err_t __wrap_esp_ipc_call_blocking(uint32_t cpu_id,
				       esp_ipc_func_t func, void *arg)
{
	static unsigned int same_core_calls;

	if (!func)
		return ESP_ERR_INVALID_ARG;
	if (cpu_id == (uint32_t)s31_linux_current_cpu()) {
		func(arg);
		if (++same_core_calls <= 8)
			s31_linux_printf("[S31] IPC same-core direct cpu=%lu call=%u\\n",
					 (unsigned long)cpu_id, same_core_calls);
		return ESP_OK;
	}
	return __real_esp_ipc_call_blocking(cpu_id, func, arg);
}

void __wrap_esp_phy_enable(esp_phy_modem_t modem)
{
	__real_esp_phy_enable(modem);
}

void __wrap_esp_phy_disable(esp_phy_modem_t modem)
{
	__real_esp_phy_disable(modem);
}

void s31_radio_coex_worker_tick(void)
{
}

static void s31_radio_coex_hw_snapshot(const char *op, unsigned int count,
				       uint8_t idx)
{
	volatile uint32_t *global = (volatile uint32_t *)(uintptr_t)0x2010f000U;
	volatile uint32_t *regs;

	if (idx >= 8 || count > 32)
		return;
	/* Repeat once at the end of the bounded trace window so the register
	 * snapshot survives the small Linux printk ring during early boot. */
	if (count <= 4 || count == 32)
		s31_linux_printf("[S31] coex HW global=%08lx/%08lx/%08lx/%08lx\n",
				 (unsigned long)global[0], (unsigned long)global[1],
				 (unsigned long)global[2], (unsigned long)global[3]);
	regs = (volatile uint32_t *)(uintptr_t)(0x2010f400U +
						 ((uint32_t)idx << 4));
	s31_linux_printf("[S31] coex HW %s=%u idx=%u regs=%08lx/%08lx/%08lx/%08lx\n",
			 op, count, idx, (unsigned long)regs[0],
			 (unsigned long)regs[1], (unsigned long)regs[2],
			 (unsigned long)regs[3]);
}

void __wrap_coex_hw_timer_set(uint8_t idx, uint8_t src, uint8_t pti,
			      uint32_t latency, uint32_t periodic)
{
	unsigned int count = __atomic_add_fetch(&s31_radio_coex_hw_sets, 1,
						 __ATOMIC_RELAXED);

	__real_coex_hw_timer_set(idx, src, pti, latency, periodic);
	if (count <= 32) {
		s31_linux_printf("[S31] coex HW set=%u idx=%u src=%u pti=%u latency=%lu periodic=%lu\n",
				 count, idx, src, pti, (unsigned long)latency,
				 (unsigned long)periodic);
		s31_radio_coex_hw_snapshot("set", count, idx);
	}
}

void __wrap_coex_hw_timer_enable(uint8_t idx)
{
	unsigned int count = __atomic_add_fetch(&s31_radio_coex_hw_enables, 1,
						 __ATOMIC_RELAXED);

	__real_coex_hw_timer_enable(idx);
	s31_radio_coex_hw_snapshot("enable", count, idx);
}

void __wrap_coex_hw_timer_disable(uint8_t idx)
{
	unsigned int count = __atomic_add_fetch(&s31_radio_coex_hw_disables, 1,
						 __ATOMIC_RELAXED);

	__real_coex_hw_timer_disable(idx);
	s31_radio_coex_hw_snapshot("disable", count, idx);
}

static int s31_radio_coex_start_trace(void)
{
	int rc;

	/* coex_enable() is entered from the closed Wi-Fi task while esp_wifi_start()
	 * is still processing its start ioctl.  IDF's registered callback normally
	 * packages wifi_on_coex_start_process() as another Wi-Fi ioctl.  A native
	 * FreeRTOS Wi-Fi task can resolve that same-task handoff, but the Linux
	 * compatibility executor cannot block the current Wi-Fi payload task and
	 * run a second instance of it.  Execute the exact callback endpoint in the
	 * already-correct owner context; the coexist policy remains untouched. */
	rc = wifi_on_coex_start_process();
	s31_linux_printf("[S31] shared coex Wi-Fi start owner-direct rc=%d interval=%lu\n",
			 rc, (unsigned long)coex_schm_interval_get());
	return rc;
}

int __wrap_coex_register_start_cb(int (*cb)(void))
{
	return __real_coex_register_start_cb(cb ?
					     s31_radio_coex_start_trace : NULL);
}

int __wrap_coex_schm_process_restart(void)
{
	static unsigned int restarts;
	int rc = __real_coex_schm_process_restart();

	if (++restarts <= 24)
		s31_linux_printf("[S31] shared coex restart=%u rc=%d interval=%lu period=%u phase=%08lx wifi=%08lx ble=%08lx bt=%08lx\n",
				 restarts, rc,
				 (unsigned long)coex_schm_interval_get(),
				 coex_schm_curr_period_get(),
				 (unsigned long)(uintptr_t)coex_schm_curr_phase_get(),
				 (unsigned long)coex_schm_status_get(COEX_SCHM_ST_TYPE_WIFI),
				 (unsigned long)coex_schm_status_get(COEX_SCHM_ST_TYPE_BLE),
				 (unsigned long)coex_schm_status_get(COEX_SCHM_ST_TYPE_BT));
	return rc;
}

static void s31_radio_coex_ble_enable_trace(void)
{
	void (*callback)(void) = __atomic_load_n(&s31_radio_coex_ble_enable_cb,
							__ATOMIC_ACQUIRE);

	s31_linux_printf("[S31] coex BLE enable callback\n");
	if (callback)
		callback();
}

static void s31_radio_coex_ble_disable_trace(void)
{
	void (*callback)(void) = __atomic_load_n(&s31_radio_coex_ble_disable_cb,
							 __ATOMIC_ACQUIRE);

	s31_linux_printf("[S31] coex BLE disable callback\n");
	if (callback)
		callback();
}

int __wrap_coex_register_ble_cb(uint8_t type, void *callback)
{
	if (type == 0) {
		__atomic_store_n(&s31_radio_coex_ble_enable_cb, callback,
				 __ATOMIC_RELEASE);
		if (callback)
			callback = s31_radio_coex_ble_enable_trace;
	} else if (type == 1) {
		__atomic_store_n(&s31_radio_coex_ble_disable_cb, callback,
				 __ATOMIC_RELEASE);
		if (callback)
			callback = s31_radio_coex_ble_disable_trace;
	}
	s31_linux_printf("[S31] coex BLE callback register type=%u cb=%08lx\n",
			 type, (unsigned long)(uintptr_t)callback);
	return __real_coex_register_ble_cb(type, callback);
}

static void s31_radio_coex_bt_phase_trace(uint32_t event, int sched_count)
{
	void (*callback)(uint32_t, int);
	unsigned int phases = __atomic_add_fetch(&s31_radio_coex_bt_phases, 1,
						__ATOMIC_RELAXED);

