PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
	callback = __atomic_load_n(&s31_radio_coex_bt_phase_cb,
				   __ATOMIC_ACQUIRE);
	if (phases <= 8)
		s31_linux_printf("[S31] shared coex BT phase=%u event=%lu count=%d\n",
				 phases, (unsigned long)event, sched_count);
	if (callback)
		callback(event, sched_count);
}

static void s31_radio_coex_wifi_phase_direct(uint32_t event, int sched_count)
{
	unsigned int phases = __atomic_add_fetch(&s31_radio_coex_wifi_phases, 1,
						__ATOMIC_RELAXED);

	if (phases <= 16)
		s31_linux_printf("[S31] shared coex Wi-Fi phase=%u event=%lu count=%d\n",
				 phases, (unsigned long)event, sched_count);
	wifi_on_coex_schm_phase_process();
}

int __wrap_coex_schm_register_callback(coex_schm_callback_type_t type,
					void *callback)
{
	if (type == COEX_SCHM_CALLBACK_TYPE_WIFI && callback) {
		callback = s31_radio_coex_wifi_phase_direct;
	} else if (type == COEX_SCHM_CALLBACK_TYPE_BT) {
		__atomic_store_n(&s31_radio_coex_bt_phase_cb, callback,
				 __ATOMIC_RELEASE);
		if (callback)
			callback = s31_radio_coex_bt_phase_trace;
	}
	return __real_coex_schm_register_callback(type, callback);
}
int __wrap_coex_enable(void)
{
	int rc;

	rc = __real_coex_enable();
	if (!rc)
		__atomic_add_fetch(&s31_radio_coex_users, 1, __ATOMIC_ACQ_REL);
	s31_linux_printf("[S31] coex native enable users=%u rc=%d\n",
			 __atomic_load_n(&s31_radio_coex_users, __ATOMIC_ACQUIRE), rc);
	return rc;
}

void __wrap_coex_disable(void)
{
	unsigned int users;

	users = __atomic_load_n(&s31_radio_coex_users, __ATOMIC_ACQUIRE);
	for (;;) {
		if (!users)
			return;
		if (__atomic_compare_exchange_n(&s31_radio_coex_users, &users,
						users - 1, false,
						__ATOMIC_ACQ_REL,
						__ATOMIC_ACQUIRE))
			 break;
	}
	__real_coex_disable();
}

static int s31_radio_clock_handoff(void)
{
	rtc_cpu_freq_config_t cpu_config;
	soc_rtc_slow_clk_src_t rtc_slow_src;
	modem_clock_lpclk_src_t wifi_lpclk_src;
	uint32_t slow_cal;
	uint32_t slow_hz;

	/* U-Boot and Linux already own the clock tree, so do not run esp_clk_init()
	 * and reprogram it.  Complete the metadata half of IDF's startup instead:
	 * ROM delay loops must know the already-selected CPU rate, and coexistence
	 * consumes the retained RTC-slow calibration through its OS adapter. */
	rtc_clk_cpu_freq_get_config(&cpu_config);
	if (!cpu_config.freq_mhz)
		return -1;
	esp_rom_set_cpu_ticks_per_us(cpu_config.freq_mhz);

	slow_hz = rtc_clk_slow_freq_get_hz();
	slow_cal = esp_clk_slowclk_cal_get();
	if (!slow_cal) {
		slow_cal = rtc_clk_cal(CLK_CAL_RTC_SLOW,
				       CONFIG_RTC_CLK_CAL_CYCLES);
		/* Linux may already have gated the calibration peripheral.  IDF uses
		 * this same nominal-period formula when startup calibration is disabled;
		 * it is also the safe fallback here because the slow-clock source itself
		 * remains firmware-owned and rtc_clk_slow_freq_get_hz() reads it back. */
		if (!slow_cal && slow_hz)
			slow_cal = (uint32_t)(((1ULL << 19) * 1000000ULL) /
					      slow_hz);
		if (!slow_cal)
			return -2;
		esp_clk_slowclk_cal_set(slow_cal);
	}

	/* esp_perip_clk_init() normally performs this selection before Wi-Fi is
	 * initialized.  Linux deliberately skips the generic IDF startup table,
	 * so carry over only its Wi-Fi low-power clock setup.  Without it the
	 * WIFIPWR sequencer has no source (MODEM_LPCON+0x0c == 0), while native
	 * IDF selects RC_SLOW on this board. */
	rtc_slow_src = rtc_clk_slow_src_get();
	wifi_lpclk_src = rtc_slow_src == SOC_RTC_SLOW_CLK_SRC_XTAL32K ?
		MODEM_CLOCK_LPCLK_SRC_XTAL32K : MODEM_CLOCK_LPCLK_SRC_RC_SLOW;
	modem_clock_select_lp_clock_source(S31_PERIPH_WIFI_MODULE,
					 wifi_lpclk_src, 0);
	s31_linux_printf("[S31] clock handoff cpu=%luMHz slow=%luHz cal=0x%08lx\n",
			 (unsigned long)cpu_config.freq_mhz,
			 (unsigned long)slow_hz,
			 (unsigned long)slow_cal);
	return 0;
}

void s31_radio_wifi_clock_enable(void)
{
	modem_clock_module_enable(S31_PERIPH_WIFI_MODULE);
}

void s31_radio_wifi_clock_disable(void)
{
	modem_clock_module_disable(S31_PERIPH_WIFI_MODULE);
}

extern void s31_radio_heap_report(const char *stage);
extern void s31_radio_report_wifi_init(int result);
extern void s31_radio_report_bt_init(int result);
extern void s31_radio_report_bt_enable(int result);
extern void s31_radio_report_bt_disable(int result);
extern void s31_radio_report_shutdown(int result);
extern void s31_radio_vhci_send_available(void);
extern int s31_radio_vhci_receive(uint8_t *frame, uint16_t length);
struct s31_wifi_ap {
	uint8_t bssid[6];
	uint8_t ssid[32];
	uint8_t ssid_length;
	uint8_t channel;
	int8_t signal;
	uint8_t authmode;
};
struct s31_wifi_connect_params {
	uint8_t ssid[32];
	uint8_t ssid_length;
	uint8_t bssid[6];
	uint8_t channel;
	uint8_t psk[32];
	uint8_t password[64];
	uint8_t password_length;
	bool has_bssid;
	bool has_psk;
	bool has_password;
	bool enterprise;
};
extern void s31_radio_wifi_scan_complete(const struct s31_wifi_ap *aps,
					 uint16_t count, int status);
extern void s31_radio_wifi_connected(const uint8_t *bssid, uint8_t channel,
				     int status);
extern void s31_radio_wifi_disconnected(uint16_t reason);
extern int s31_radio_wifi_receive(uint8_t *frame, uint16_t length);
extern int s31_radio_wifi_receive_zerocopy(uint8_t *frame, void *eb,
					    uint16_t length);
extern void s31_radio_wifi_intr_configure(uint32_t source,
					 uint32_t logical_intr, uint32_t priority);
extern void s31_radio_wifi_intr_set_isr(uint32_t logical_intr,
					void (*handler)(void *), void *arg);
extern void s31_radio_wifi_intr_mask(uint32_t mask, bool enable);

#endif

#ifdef S31_LINUX_SMODE
static void s31_vhci_send_available(void)
{
	s31_radio_vhci_send_available();
}

static int s31_vhci_receive(uint8_t *data, uint16_t len)
{
	return s31_radio_vhci_receive(data, len);
}

#ifndef S31_WIFI_ONLY
static const esp_vhci_host_callback_t s31_vhci_callbacks = {
	.notify_host_send_available = s31_vhci_send_available,
	.notify_host_recv = s31_vhci_receive,
};
#endif

enum s31_wifi_pending_operation {
	S31_WIFI_PENDING_NONE,
	S31_WIFI_PENDING_SCAN,
	S31_WIFI_PENDING_CONNECT,
};

