PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
static int s31_wifi_prepared;
static bool s31_wifi_ap_active;
static volatile int s31_wifi_ap_ready;
static uint8_t *s31_eap_fields[S31_EAP_FIELDS];
static uint32_t s31_eap_lengths[S31_EAP_FIELDS];
static uint32_t s31_eap_received[S31_EAP_FIELDS];
static bool s31_eap_enabled;
static int s31_wifi_start_requested;
static int s31_wifi_start_complete;
static int s31_wifi_rx_registered;
static enum s31_wifi_pending_operation s31_wifi_pending;
static uint32_t s31_wifi_tx_done_count;

/* Descriptor capture is disabled during normal operation.  One sample is
 * enough to identify the descriptor layout when explicitly enabled and does
 * not permanently consume more than 3 KiB of the unified module's BSS. */
#define S31_TX_DESC_SAMPLES 1
#define S31_TX_DESC_BYTES 72
#define S31_TX_FRAME_BYTES 48

struct s31_tx_desc_sample {
	uint32_t eb;
	uint32_t frame;
	uint32_t flags;
	uint32_t control;
	uint16_t length;
	uint8_t tid;
	uint8_t desc[S31_TX_DESC_BYTES];
	uint8_t header[S31_TX_FRAME_BYTES];
};

static struct s31_tx_desc_sample s31_tx_desc_samples[S31_TX_DESC_SAMPLES];
static uint32_t s31_tx_desc_sample_count;
static bool s31_tx_desc_samples_dumped;
static uint32_t s31_tx_desc_call_count;
static uint32_t s31_tx_desc_bad_eb_count;
static uint32_t s31_tx_desc_bad_desc_count;
static uint32_t s31_tx_desc_bad_frame_count;
static uint32_t s31_tx_desc_nondata_count;
static bool s31_tx_desc_capture_enabled;
static uint32_t s31_tx_desc_ipv4_submit_count;

#define S31_KEY_SAMPLES 1
#define S31_KEY_INFO_BYTES 12

struct s31_key_sample {
	uint32_t slot;
	uint32_t key_len;
	uint32_t key_hash;
	uint8_t key_info[S31_KEY_INFO_BYTES];
};

static struct s31_key_sample s31_key_samples[S31_KEY_SAMPLES];
static uint32_t s31_key_sample_count;
static uint32_t s31_key_call_count;
static bool s31_key_capture_enabled;
static uint32_t s31_wifi_rx_count;

static uint32_t s31_lmac_txerr_count;
static uint32_t s31_lmac_txerr_seckid_count;
static uint32_t s31_lmac_txdone_count;
static uint32_t s31_lmac_txdone_bad_count;

extern void __real_ieee80211_set_tx_desc(void *ic, void *eb, uint32_t tid,
					 uint32_t flags, uint32_t control);
extern int __real_lmacTxFrame(void *eb, uint32_t queue);
extern void __real_hal_crypto_set_key_entry(int key_idx, const void *key,
					    int key_len, const void *key_info);
extern void __real_lmacProcessTxError(int err_type, int status, void *arg);
extern int __real_lmacTxDone(void *eb, int status);
extern int esp_test_get_hw_rx_statistics(uint16_t *stats);

static bool s31_radio_ptr_is_hpsram(const void *ptr, size_t length)
{
	uintptr_t start = (uintptr_t)ptr;
	uintptr_t end = start + length;

	return start >= 0x2f000000U && end >= start && end <= 0x2f800000U;
}

static uint32_t s31_fnv1a(const uint8_t *data, size_t len)
{
	uint32_t hash = 2166136261u;
	size_t i;

	for (i = 0; i < len; i++) {
		hash ^= data[i];
		hash *= 16777619u;
	}
	return hash;
}

void __wrap_ieee80211_set_tx_desc(void *ic, void *eb, uint32_t tid,
				  uint32_t flags, uint32_t control)
{
	struct s31_tx_desc_sample *sample;
	uint8_t *desc;
	uint8_t *frame = NULL;
	void *buffer;
	uint32_t index;
	uint32_t i;

	__real_ieee80211_set_tx_desc(ic, eb, tid, flags, control);
	s31_tx_desc_call_count++;
	if (!s31_radio_ptr_is_hpsram(eb, 56)) {
		s31_tx_desc_bad_eb_count++;
		return;
	}
	desc = *(uint8_t **)((uint8_t *)eb + 52);
	buffer = *(void **)((uint8_t *)eb + 4);
	if (s31_radio_ptr_is_hpsram(buffer, 8))
		frame = *(uint8_t **)((uint8_t *)buffer + 4);
	if (!s31_radio_ptr_is_hpsram(desc, S31_TX_DESC_BYTES)) {
		s31_tx_desc_bad_desc_count++;
		return;
	}
	if (!s31_radio_ptr_is_hpsram(frame, 8 + S31_TX_FRAME_BYTES)) {
		s31_tx_desc_bad_frame_count++;
		return;
	}
	frame += 8;
	if (!s31_tx_desc_capture_enabled || (frame[0] & 0x0c) != 0x08 ||
	    !(frame[1] & 0x40)) {
		s31_tx_desc_nondata_count++;
		return;
	}
	index = s31_tx_desc_sample_count;
	if (index >= S31_TX_DESC_SAMPLES)
		return;
	s31_tx_desc_sample_count = index + 1;
	sample = &s31_tx_desc_samples[index];
	sample->eb = (uintptr_t)eb;
	sample->frame = (uintptr_t)frame;
	sample->flags = flags;
	sample->control = control;
	sample->length = *(uint16_t *)((uint8_t *)eb + 22);
	sample->tid = tid;
	for (i = 0; i < S31_TX_DESC_BYTES; i++)
		sample->desc[i] = desc[i];
	for (i = 0; i < S31_TX_FRAME_BYTES; i++)
		sample->header[i] = frame[i];
}

int __wrap_lmacTxFrame(void *eb, uint32_t queue)
{
	struct s31_tx_desc_sample *sample;
	uint8_t *desc;
	uint8_t *frame = NULL;
	void *buffer;
	uint32_t index;
	uint32_t i;

	s31_tx_desc_call_count++;
	if (!s31_radio_ptr_is_hpsram(eb, 56)) {
		s31_tx_desc_bad_eb_count++;
		return __real_lmacTxFrame(eb, queue);
	}
	desc = *(uint8_t **)((uint8_t *)eb + 52);
	buffer = *(void **)((uint8_t *)eb + 4);
	if (s31_radio_ptr_is_hpsram(buffer, 8))
		frame = *(uint8_t **)((uint8_t *)buffer + 4);
	if (!s31_radio_ptr_is_hpsram(desc, S31_TX_DESC_BYTES)) {
		s31_tx_desc_bad_desc_count++;
		return __real_lmacTxFrame(eb, queue);
	}
	if (!s31_radio_ptr_is_hpsram(frame, 8 + S31_TX_FRAME_BYTES)) {
		s31_tx_desc_bad_frame_count++;
		return __real_lmacTxFrame(eb, queue);
	}
	frame += 8;
	if (!s31_tx_desc_capture_enabled || (frame[0] & 0x0c) != 0x08 ||
	    !(frame[1] & 0x40)) {
		s31_tx_desc_nondata_count++;
		return __real_lmacTxFrame(eb, queue);
	}
	index = s31_tx_desc_sample_count;
	if (index < S31_TX_DESC_SAMPLES) {
		s31_tx_desc_sample_count = index + 1;
		sample = &s31_tx_desc_samples[index];
		sample->eb = (uintptr_t)eb;
		sample->frame = (uintptr_t)frame;
		sample->flags = 0x4c4d4143U;
		sample->control = queue;
		sample->length = *(uint16_t *)((uint8_t *)eb + 22);
		sample->tid = queue;
		for (i = 0; i < S31_TX_DESC_BYTES; i++)
			sample->desc[i] = desc[i];
		for (i = 0; i < S31_TX_FRAME_BYTES; i++)
			sample->header[i] = frame[i];
	}
	return __real_lmacTxFrame(eb, queue);
}

void __wrap_hal_crypto_set_key_entry(int key_idx, const void *key,
				     int key_len, const void *key_info)
{
	struct s31_key_sample *sample;
	const uint8_t *info = key_info;
	uint32_t call = ++s31_key_call_count;
	uint32_t i;

