PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
	if (call <= 8)
		s31_linux_printf("[S31] KEYSET #%u enter slot=%d len=%d\n",
				 call, key_idx, key_len);
	__real_hal_crypto_set_key_entry(key_idx, key, key_len, key_info);
	if (call <= 8)
		s31_linux_printf("[S31] KEYSET #%u return\n", call);
	if (!s31_key_capture_enabled ||
	    !s31_radio_ptr_is_hpsram(info, S31_KEY_INFO_BYTES) ||
	    s31_key_sample_count >= S31_KEY_SAMPLES)
		return;
	sample = &s31_key_samples[s31_key_sample_count++];
	sample->slot = key_idx;
	sample->key_len = key_len;
	sample->key_hash = s31_fnv1a(key, key_len);
	for (i = 0; i < S31_KEY_INFO_BYTES; i++)
		sample->key_info[i] = info[i];
}

void __wrap_lmacProcessTxError(int err_type, int status, void *arg)
{
	uint32_t count = ++s31_lmac_txerr_count;
	void *caller = __builtin_return_address(0);

	if (status == 192)
		s31_lmac_txerr_seckid_count++;
	if (count <= 32 || status == 192 || status == 0 || status == 1 ||
	    status == 2)
		s31_linux_printf("[S31] LMACTXERR #%u type=%d status=%d(0x%x) arg=%px caller=%px cpu=%ld\n",
			       count, err_type, status, status, arg, caller,
			       (long)s31_linux_current_cpu());
	__real_lmacProcessTxError(err_type, status, arg);
}

int __wrap_lmacTxDone(void *eb, int status)
{
	s31_lmac_txdone_count++;

	if (status != 0)
		s31_lmac_txdone_bad_count++;
	return __real_lmacTxDone(eb, status);
}

static void s31_wifi_dump_crypto_regs(void);
static void s31_wifi_dump_rx_stats(void);

static void s31_wifi_dump_crypto_samples(void)
{
	uint32_t i;
	uint32_t j;

	s31_linux_printf("[S31] LMACTXERR total=%u seckid=%u txdone=%u txdone-bad=%u keys=%u\n",
		       s31_lmac_txerr_count, s31_lmac_txerr_seckid_count,
		       s31_lmac_txdone_count, s31_lmac_txdone_bad_count,
		       s31_key_sample_count);
	for (i = 0; i < s31_key_sample_count; i++) {
		struct s31_key_sample *sample = &s31_key_samples[i];

		s31_linux_printf("[S31] KEY #%u slot=%u len=%u fnv=%08x info=",
			       i, sample->slot, sample->key_len, sample->key_hash);
		for (j = 0; j < S31_KEY_INFO_BYTES; j++)
			s31_linux_printf("%02x", sample->key_info[j]);
		s31_linux_printf("\n");
	}
	s31_wifi_dump_crypto_regs();
}

static void s31_wifi_dump_crypto_regs(void)
{
	volatile const uint32_t *base = (volatile const uint32_t *)0x20104800;
	uint32_t slot;

	s31_linux_printf("[S31] CRYPTO c0=%08x c1=%08x c2=%08x c3=%08x cfg=%08x valid=%08x\n",
		       base[0], base[1], base[2], base[3], base[4], base[5]);
	/* Dump only the key-entry metadata words (peer MAC + cipher word) and an
	 * FNV-1a fingerprint of the installed key bytes (never the key itself). */
	for (slot = 0; slot < 6; slot++) {
		volatile const uint32_t *entry =
			(volatile const uint32_t *)(0x20105800 + slot * 40);
		uint32_t hash;

		if (!(base[5] & (1u << slot)))
			continue;
		hash = s31_fnv1a((const uint8_t *)(entry + 2), 16);
		s31_linux_printf("[S31] KEYS slot=%u hdr0=%08x hdr1=%08x keyfnv=%08x\n",
			       slot, entry[0], entry[1], hash);
	}
	s31_wifi_dump_rx_stats();
}

static void s31_wifi_dump_rx_stats(void)
{
	uint16_t stats[48] = { 0 };
	uint32_t i;
	int rc = esp_test_get_hw_rx_statistics(stats);

	s31_linux_printf("[S31] RXSTAT rc=%d", rc);
	for (i = 0; i < 37; i++)
		s31_linux_printf(" %u:%u", i, stats[i]);
	s31_linux_printf(" w38=%08x w40=%08x\n",
		       *(uint32_t *)((uint8_t *)stats + 76),
		       *(uint32_t *)((uint8_t *)stats + 80));
}

static void s31_wifi_dump_tx_desc_samples(void)
{
	uint32_t count = s31_tx_desc_sample_count;
	uint32_t i;
	uint32_t j;

	if (s31_tx_desc_samples_dumped)
		return;
	if (count > S31_TX_DESC_SAMPLES)
		count = S31_TX_DESC_SAMPLES;
	s31_linux_printf("[S31] TXDESC status calls=%u samples=%u bad-eb=%u bad-desc=%u bad-frame=%u nondata=%u\n",
		       s31_tx_desc_call_count, count, s31_tx_desc_bad_eb_count,
		       s31_tx_desc_bad_desc_count, s31_tx_desc_bad_frame_count,
		       s31_tx_desc_nondata_count);
	if (!count)
		return;
	s31_tx_desc_samples_dumped = true;
	for (i = 0; i < count; i++) {
		struct s31_tx_desc_sample *sample = &s31_tx_desc_samples[i];

		s31_linux_printf("[S31] TXDESC #%u eb=%08x frame=%08x len=%u tid=%u flags=%08x ctl=%08x desc=",
			       i, sample->eb, sample->frame, sample->length,
			       sample->tid, sample->flags, sample->control);
		for (j = 0; j < S31_TX_DESC_BYTES; j++)
			s31_linux_printf("%02x", sample->desc[j]);
		s31_linux_printf(" hdr=");
		for (j = 0; j < S31_TX_FRAME_BYTES; j++)
			s31_linux_printf("%02x", sample->header[j]);
		s31_linux_printf("\n");
	}
}

/* esp_wifi_internal_tx() copies Linux frames, so the by-reference callbacks
 * are not expected to run.  The native ESP-IDF station glue still registers
 * them at STA_START and the closed driver uses that registration as part of
 * bringing up its netstack-facing data path. */
static void s31_wifi_netstack_ref(void *buffer)
{
	(void)buffer;
}

static void s31_wifi_netstack_free(void *buffer)
{
	(void)buffer;
}

static void s31_wifi_tx_done(uint8_t interface, uint8_t *data,
			     uint16_t *length, bool status)
{
	s31_wifi_tx_done_count++;

	s31_radio_timing_tx_done(status, data, length ? *length : 0);
	(void)interface;
	(void)data;
}

static void s31_wifi_set_intr(int32_t cpu_no, uint32_t source,
			      uint32_t logical_intr, int32_t priority)
{
	(void)cpu_no;
	s31_radio_wifi_intr_configure(source, logical_intr, priority);
}

static void s31_wifi_set_isr(int32_t logical_intr, void *handler, void *arg)
{
	s31_linux_printf("[S31] Wi-Fi set_isr logical=%d handler=%p arg=%p\n",
		       logical_intr, handler, arg);
	s31_radio_wifi_intr_set_isr(logical_intr,
				     (void (*)(void *))handler, arg);
}

static void s31_wifi_ints_on(uint32_t mask)
{
	s31_radio_wifi_intr_mask(mask, true);
}

static void s31_wifi_ints_off(uint32_t mask)
{
	s31_radio_wifi_intr_mask(mask, false);
}

static bool s31_wifi_is_from_isr(void)
{
	/* Match S31 esp_adapter.c exactly: _is_from_isr is implemented as
	 * !xPortCanYield(), despite its name.  On the CLIC port xPortCanYield()
	 * is false both in an ISR and while the interrupt threshold is raised by
	 * a task critical section.  Looking only at deferred-ISR nesting made the
	 * blob select blocking queue APIs while its critical section was active. */
	return !s31_rtos_can_yield();
}

/* Recycled by the Linux worker inside the blob pass once the net stack has
 * consumed the frame.  Kept in blob context (gate held) so it is serialized
 * with the MAC RX esf_buf allocator. */
void s31_radio_wifi_free_rx_buffer(void *eb)
{
	if (eb)
		esp_wifi_internal_free_rx_buffer(eb);
}

static int s31_wifi_rx(void *buffer, uint16_t length, void *eb)
{
	const uint8_t *frame = buffer;
	uint32_t count = ++s31_wifi_rx_count;
	int rc = s31_radio_wifi_receive_zerocopy(buffer, eb, length);

	if (count <= 8)
		s31_linux_printf("[S31] RXDATA #%u len=%u type=%02x%02x rc=%d\n",
			       count, length, length >= 14 ? frame[12] : 0,
			       length >= 14 ? frame[13] : 0, rc);

	/* The Linux bridge copied the frame into its staging ring.  Return the
	 * closed driver's esf_buf before leaving the callback so RX progress does
	 * not depend on the worker reacquiring the blob gate. */
	if (eb)
		esp_wifi_internal_free_rx_buffer(eb);
	if (!rc)
		s31_radio_wifi_rx_throttle();
	return rc;
}

static int s31_wifi_ap_rx(void *buffer, uint16_t length, void *eb)
{
	s31_radio_wifi_receive_aux(S31_WIFI_IF_AP, buffer, length, 0, 0);
	if (eb)
		esp_wifi_internal_free_rx_buffer(eb);
	return 0;
}

