PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
static void s31_wifi_monitor_rx(void *buffer, wifi_promiscuous_pkt_type_t type)
{
	const wifi_promiscuous_pkt_t *packet = buffer;

	if (type != WIFI_PKT_MGMT && type != WIFI_PKT_DATA)
		return;
	if (packet->rx_ctrl.sig_len < 4 || packet->rx_ctrl.sig_len > 4096 ||
	    packet->rx_ctrl.rx_state)
		return;
	s31_radio_wifi_receive_aux(S31_WIFI_IF_MONITOR, packet->payload,
		packet->rx_ctrl.sig_len, packet->rx_ctrl.channel, packet->rx_ctrl.rssi);
}

static int s31_wifi_prepare(void)
{
	static const wifi_country_t country = {
		.cc = "CN",
		.schan = 1,
		.nchan = 13,
		.policy = WIFI_COUNTRY_POLICY_MANUAL,
	};
	int rc = 0;

	if (!s31_wifi_prepared) {
		/* Match the native ESP-IDF station setup used on this chip.  In
		 * particular, keep the closed driver out of its HE and modem-sleep
		 * paths until those timing services are modelled by the Linux shim. */
		rc = esp_wifi_set_storage(WIFI_STORAGE_RAM);
		if (!rc)
			rc = esp_wifi_set_country(&country);
		if (!rc)
			rc = esp_wifi_set_mode(WIFI_MODE_STA);
		if (!rc)
			rc = esp_wifi_set_protocol(WIFI_IF_STA,
				WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
				WIFI_PROTOCOL_11N);
		if (!rc)
			rc = esp_wifi_set_ps(WIFI_PS_NONE);
		if (!rc)
			rc = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW40);
		if (!rc)
			s31_wifi_prepared = 1;
	}
	return rc;
}

/* Returns one when the caller may run now, zero when STA_START will run it. */
static int s31_wifi_start_operation(enum s31_wifi_pending_operation operation)
{
	int rc;

	if (s31_wifi_start_complete)
		return 1;
	if (s31_wifi_pending != S31_WIFI_PENDING_NONE)
		return -1;
	s31_wifi_pending = operation;
	if (s31_wifi_start_requested)
		return 0;
	rc = esp_wifi_start();
	if (rc) {
		s31_wifi_pending = S31_WIFI_PENDING_NONE;
		return -rc;
	}
	s31_wifi_start_requested = 1;
	return 0;
}

static void s31_wifi_event(void *arg, esp_event_base_t base, int32_t id,
			   void *event_data)
{
	wifi_ap_record_t *records = NULL;
	struct s31_wifi_ap *aps = NULL;
	uint16_t count = 32;
	int rc;
	int i;

	(void)arg;
	(void)base;
	if (id == WIFI_EVENT_AP_STACONNECTED) {
		const wifi_event_ap_staconnected_t *station = event_data;

		s31_radio_wifi_ap_station(station->mac, true);
		return;
	}
	if (id == WIFI_EVENT_AP_STADISCONNECTED) {
		const wifi_event_ap_stadisconnected_t *station = event_data;

		s31_radio_wifi_ap_station(station->mac, false);
		return;
	}
	if (id == WIFI_EVENT_AP_START) {
		rc = esp_wifi_internal_reg_netstack_buf_cb(
			s31_wifi_netstack_ref, s31_wifi_netstack_free);
		if (!rc)
			rc = esp_wifi_internal_reg_rxcb(WIFI_IF_AP, s31_wifi_ap_rx);
		s31_wifi_ap_ready = rc ? -1 : 1;
		return;
	}
	if (id == WIFI_EVENT_AP_STOP) {
		s31_wifi_ap_ready = 0;
		return;
	}
	if (id == WIFI_EVENT_STA_STOP) {
		s31_wifi_start_complete = 0;
		s31_wifi_start_requested = 0;
		s31_radio_wifi_disconnected(3);
		return;
	}
	if (id == WIFI_EVENT_STA_START) {
		enum s31_wifi_pending_operation pending = s31_wifi_pending;

		s31_wifi_pending = S31_WIFI_PENDING_NONE;
		s31_wifi_start_complete = 1;
		s31_wifi_start_requested = 1;
		s31_key_sample_count = 0;
		s31_key_capture_enabled = true;
		rc = esp_wifi_internal_reg_netstack_buf_cb(
			s31_wifi_netstack_ref, s31_wifi_netstack_free);
		s31_linux_printf("[S31] Wi-Fi STA_START rc=%d pending=%u\n",
			       rc, pending);
		if (!rc && pending == S31_WIFI_PENDING_SCAN)
			rc = esp_wifi_scan_start(NULL, false);
		else if (!rc && pending == S31_WIFI_PENDING_CONNECT)
			rc = esp_wifi_connect();
		if (rc && pending == S31_WIFI_PENDING_SCAN)
			s31_radio_wifi_scan_complete(NULL, 0, rc);
		else if (rc && pending == S31_WIFI_PENDING_CONNECT)
			s31_radio_wifi_connected(NULL, 0, rc);
		return;
	}
	if (id != WIFI_EVENT_SCAN_DONE)
		goto non_scan_event;
	records = heap_caps_malloc(sizeof(*records) * count, 0);
	aps = heap_caps_malloc(sizeof(*aps) * count, 0);
	if (!records || !aps) {
		heap_caps_free(records);
		heap_caps_free(aps);
		s31_radio_wifi_scan_complete(NULL, 0, -1);
		return;
	}
	rc = esp_wifi_scan_get_ap_records(&count, records);
	if (rc) {
		heap_caps_free(records);
		heap_caps_free(aps);
		s31_radio_wifi_scan_complete(NULL, 0, rc);
		return;
	}
	for (i = 0; i < count; i++) {
		size_t length = strnlen((const char *)records[i].ssid, 32);

		memcpy(aps[i].bssid, records[i].bssid, sizeof(aps[i].bssid));
		memcpy(aps[i].ssid, records[i].ssid, length);
		if (length < sizeof(aps[i].ssid))
			memset(aps[i].ssid + length, 0, sizeof(aps[i].ssid) - length);
		aps[i].ssid_length = length;
		aps[i].channel = records[i].primary;
		aps[i].signal = records[i].rssi;
		aps[i].authmode = records[i].authmode;
	}
	heap_caps_free(records);
	s31_radio_wifi_scan_complete(aps, count, 0);
	heap_caps_free(aps);
	return;

non_scan_event:
	if (id == WIFI_EVENT_STA_CONNECTED) {
		wifi_event_sta_connected_t *event = event_data;

		/* Association traffic fills the small capture ring before Linux can
		 * submit DHCP.  Start a fresh window at the protected data boundary. */
		s31_tx_desc_sample_count = 0;
		s31_tx_desc_samples_dumped = false;
		s31_tx_desc_call_count = 0;
		s31_tx_desc_bad_eb_count = 0;
		s31_tx_desc_bad_desc_count = 0;
		s31_tx_desc_bad_frame_count = 0;
		s31_tx_desc_nondata_count = 0;
		s31_tx_desc_ipv4_submit_count = 0;
		s31_tx_desc_capture_enabled = true;
		s31_wifi_rx_count = 0;
		s31_lmac_txerr_count = 0;
		s31_lmac_txerr_seckid_count = 0;
		s31_lmac_txdone_count = 0;
		s31_lmac_txdone_bad_count = 0;
		/* Match wifi_default_action_sta_connected(): the S31 station data
		 * interface becomes ready only after association, so registering at
		 * STA_START can return success without attaching the RX data path. */
		rc = esp_wifi_internal_reg_rxcb(WIFI_IF_STA, s31_wifi_rx);
		if (!rc)
			s31_wifi_rx_registered = 1;
		if (!rc)
			rc = esp_wifi_set_tx_done_cb(s31_wifi_tx_done);
		s31_linux_printf("[S31] RX slots ref=%p sta=%p free=%p expected=%p\n",
			       *(void * volatile *)0x2f07ff68,
			       *(void * volatile *)0x2f07ff6c,
			       *(void * volatile *)0x2f07ff78, s31_wifi_rx);
		s31_linux_printf("[S31] Wi-Fi STA connected channel=%u data-cb=%d\n",
			       event->channel, rc);
		s31_radio_wifi_connected(event->bssid, event->channel, rc);
	} else if (id == WIFI_EVENT_STA_DISCONNECTED) {
		wifi_event_sta_disconnected_t *event = event_data;

		s31_linux_printf("[S31] Wi-Fi STA disconnected reason=%u\n",
			       event->reason);
		s31_radio_wifi_disconnected(event->reason);
	}
}

