PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
int s31_radio_vhci_try_send(uint8_t *frame, uint16_t length)
{
	if (!esp_vhci_host_check_send_available())
		return -1;
	if (length >= 7 && frame[0] == 0x01 && frame[1] == 0x24 &&
	    frame[2] == 0x0c)
		s31_linux_printf("[S31] VHCI TX 0x0c24 len=%u cod=%02x%02x%02x\n",
				 length, frame[4], frame[5], frame[6]);
	esp_vhci_host_send_packet(frame, length);
	return 0;
}

void s31_radio_wifi_scan_task(void *arg)
{
	int rc = 0;
	int start;

	(void)arg;
	rc = s31_wifi_prepare();
	if (!rc) {
		start = s31_wifi_start_operation(S31_WIFI_PENDING_SCAN);
		if (start > 0)
			rc = esp_wifi_scan_start(NULL, false);
		else if (start < 0)
			rc = -start;
	}
	if (rc)
		s31_radio_wifi_scan_complete(NULL, 0, rc);
}

void s31_radio_wifi_connect_task(void *arg)
{
	const struct s31_wifi_connect_params *params = arg;
	wifi_config_t config = { 0 };
	static const char hex[] = "0123456789abcdef";
	int rc;
	int i;
	int start;

	rc = s31_wifi_prepare();
	if (rc)
		goto failed;
	memcpy(config.sta.ssid, params->ssid, params->ssid_length);
	config.sta.channel = params->channel;
	config.sta.bssid_set = params->has_bssid;
	if (params->has_bssid)
		memcpy(config.sta.bssid, params->bssid, sizeof(config.sta.bssid));
	if (params->enterprise) {
		if (!s31_eap_enabled) {
			rc = ESP_ERR_INVALID_STATE;
			goto failed;
		}
		config.sta.threshold.authmode = WIFI_AUTH_WPA2_ENTERPRISE;
	} else if (params->has_password) {
		memcpy(config.sta.password, params->password,
		       params->password_length);
		/* Match the last known-good native S31 IDF path: a WPA-length
		 * plaintext password is normalized from OPEN to WPA2 internally. */
	} else if (params->has_psk) {
		for (i = 0; i < 32; i++) {
			config.sta.password[i * 2] = hex[params->psk[i] >> 4];
			config.sta.password[i * 2 + 1] = hex[params->psk[i] & 0xf];
		}
		config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
		/* cfg80211 supplies a derived PMK, not the plaintext needed by SAE.
		 * On WPA2/WPA3 transition BSSes force the WPA2 path so the closed
		 * driver interprets the 64 hex digits above as a raw PSK. */
		config.sta.disable_wpa3_compatible_mode = 1;
	} else {
		config.sta.threshold.authmode = WIFI_AUTH_OPEN;
	}
	rc = esp_wifi_set_config(WIFI_IF_STA, &config);
	s31_linux_printf("[S31] Wi-Fi set_config rc=%d security=%s\n", rc,
		       params->enterprise ? "enterprise" :
		       params->has_password ? "WPA2/WPA3" :
		       params->has_psk ? "WPA2-PSK" : "open");
	if (!rc) {
		start = s31_wifi_start_operation(S31_WIFI_PENDING_CONNECT);
		if (start > 0)
			rc = esp_wifi_connect();
		else if (start < 0)
			rc = -start;
	}
	s31_linux_printf("[S31] Wi-Fi connect submit rc=%d\n", rc);
failed:
	if (rc)
		s31_radio_wifi_connected(NULL, 0, rc);
}

void s31_radio_wifi_disconnect_task(void *arg)
{
	extern void s31_linux_timer_report(void);

	(void)arg;
	if (esp_wifi_disconnect())
		s31_radio_wifi_disconnected(0);
	s31_linux_timer_report();
}

int s31_radio_wifi_read_mac(uint8_t *mac)
{
	/* Reading the configured STA address does not require esp_wifi_start().
	 * Keep start on a compatibility-RTOS task: the closed driver accepts a
	 * worker-thread call but never completes its internal start transition.
	 */
	return esp_wifi_get_mac(WIFI_IF_STA, mac);
}

int s31_radio_wifi_try_send(uint8_t *frame, uint16_t length)
{
	bool ipv4 = length >= 14 && frame[12] == 0x08 && frame[13] == 0x00;
	uint32_t submit;
	int rc;

	/* esp_wifi_internal_tx() only queues the Ethernet frame.  By the second
	 * DHCP retry, the first one has traversed the asynchronous Wi-Fi task and
	 * lmacTxFrame(), so dump that completed capture before queuing another. */
	if (ipv4)
		s31_tx_desc_ipv4_submit_count++;
	submit = s31_tx_desc_ipv4_submit_count;
	if (ipv4 && submit <= 4) {
		s31_linux_printf("[S31] TXDATA #%u enter len=%u\n", submit, length);
		if (submit == 1)
			s31_wifi_dump_crypto_samples();
	}
	rc = esp_wifi_internal_tx(WIFI_IF_STA, frame, length);
	if (ipv4 && submit <= 4) {
		s31_linux_printf("[S31] TXDATA #%u return rc=%d txdone=%u\n",
			       submit, rc, s31_wifi_tx_done_count);
		s31_wifi_dump_tx_desc_samples();
	}
	return rc;
}

int s31_radio_wifi_try_send_interface(uint8_t interface, uint8_t *frame, uint16_t length)
{
	if (interface == S31_WIFI_IF_STA)
		return s31_radio_wifi_try_send(frame, length);
	if (interface != S31_WIFI_IF_AP || !s31_wifi_ap_active)
		return ESP_ERR_WIFI_IF;
	return esp_wifi_internal_tx(WIFI_IF_AP, frame, length);
}

static void s31_wifi_eap_clear(void)
{
	unsigned int i;

	esp_wifi_sta_enterprise_disable();
	esp_eap_client_clear_identity();
	esp_eap_client_clear_username();
	esp_eap_client_clear_password();
	esp_eap_client_clear_ca_cert();
	esp_eap_client_clear_certificate_and_key();
	for (i = 0; i < S31_EAP_FIELDS; i++) {
		if (s31_eap_fields[i]) {
			/* Volatile stores prevent deletion of the credential wipe. */
			volatile uint8_t *p = s31_eap_fields[i];
			uint32_t n = s31_eap_lengths[i] + 1;

			while (n--)
				*p++ = 0;
			heap_caps_free(s31_eap_fields[i]);
		}
		s31_eap_fields[i] = NULL;
		s31_eap_lengths[i] = s31_eap_received[i] = 0;
	}
	s31_eap_enabled = false;
}

static int s31_wifi_eap_control(const struct s31_wifi_control *request)
{
	uint32_t field = request->field;
	unsigned int i;
	int rc;

	if (request->operation == S31_WIFI_EAP_CLEAR) {
		s31_wifi_eap_clear();
		return 0;
	}
	if (request->operation == S31_WIFI_EAP_WRITE) {
		if (s31_eap_enabled || field >= S31_EAP_FIELDS ||
		    !request->total || request->total > S31_EAP_MAX_FIELD ||
		    !request->length || request->length > S31_EAP_CHUNK ||
		    request->offset > request->total ||
		    request->length > request->total - request->offset)
			return ESP_ERR_INVALID_ARG;
		if (!request->offset) {
			if (s31_eap_fields[field])
				return ESP_ERR_INVALID_STATE;
			s31_eap_fields[field] = heap_caps_calloc(1, request->total + 1, 0);
			if (!s31_eap_fields[field])
				return ESP_ERR_NO_MEM;
			s31_eap_lengths[field] = request->total;
		}
		if (!s31_eap_fields[field] || request->total != s31_eap_lengths[field] ||
		    request->offset != s31_eap_received[field])
			return ESP_ERR_INVALID_ARG;
		memcpy(s31_eap_fields[field] + request->offset, request->data, request->length);
		s31_eap_received[field] += request->length;
		return 0;
	}
	for (i = 0; i < S31_EAP_FIELDS; i++)
		if (s31_eap_lengths[i] != s31_eap_received[i])
			return ESP_ERR_INVALID_STATE;
	if (!s31_eap_lengths[S31_EAP_IDENTITY] || !s31_eap_lengths[S31_EAP_CA] ||
	    !s31_eap_lengths[S31_EAP_DOMAIN] ||
	    (!!s31_eap_lengths[S31_EAP_CERT] != !!s31_eap_lengths[S31_EAP_KEY]) ||
	    (!s31_eap_lengths[S31_EAP_CERT] &&
	     (!s31_eap_lengths[S31_EAP_USERNAME] || !s31_eap_lengths[S31_EAP_PASSWORD])))
		return ESP_ERR_INVALID_ARG;
	rc = esp_eap_client_set_identity(s31_eap_fields[S31_EAP_IDENTITY], s31_eap_lengths[S31_EAP_IDENTITY]);
	if (!rc)
		rc = esp_eap_client_set_ca_cert(s31_eap_fields[S31_EAP_CA], s31_eap_lengths[S31_EAP_CA] + 1);
	if (!rc)
		rc = esp_eap_client_set_domain_name((const char *)s31_eap_fields[S31_EAP_DOMAIN]);
	if (!rc)
		rc = esp_eap_client_set_disable_time_check(false);
	if (!rc && s31_eap_lengths[S31_EAP_CERT]) {
		rc = esp_eap_client_set_certificate_and_key(s31_eap_fields[S31_EAP_CERT],
			s31_eap_lengths[S31_EAP_CERT] + 1, s31_eap_fields[S31_EAP_KEY],
			s31_eap_lengths[S31_EAP_KEY] + 1, NULL, 0);
		if (!rc)
			rc = esp_eap_client_set_eap_methods(ESP_EAP_TYPE_TLS);
	} else if (!rc) {
		rc = esp_eap_client_set_username(s31_eap_fields[S31_EAP_USERNAME], s31_eap_lengths[S31_EAP_USERNAME]);
		if (!rc)
			rc = esp_eap_client_set_password(s31_eap_fields[S31_EAP_PASSWORD], s31_eap_lengths[S31_EAP_PASSWORD]);
		if (!rc)
			rc = esp_eap_client_set_eap_methods(ESP_EAP_TYPE_PEAP);
	}
	if (!rc)
		rc = esp_wifi_sta_enterprise_enable();
	s31_eap_enabled = !rc;
	return rc;
}

void s31_radio_wifi_control_task(void *arg)
{
	const struct s31_wifi_control *request = arg;
	wifi_config_t config = { 0 };
	static const char hex[] = "0123456789abcdef";
	int rc = s31_wifi_prepare();
	unsigned int i;

