PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
	if (rc)
		goto done;
	switch (request->operation) {
	case S31_WIFI_EAP_WRITE:
	case S31_WIFI_EAP_COMMIT:
	case S31_WIFI_EAP_CLEAR:
		rc = s31_wifi_eap_control(request);
		break;
	case S31_WIFI_AP_START:
		if (!request->ssid_length || request->ssid_length > 32 ||
		    request->password_length > 63 || request->channel < 1 ||
		    request->channel > 13) {
			rc = ESP_ERR_INVALID_ARG;
			break;
		}
		/* Configure before starting the AP: never briefly advertise an
		 * unprotected default BSS while installing the requested keys. */
		if (s31_wifi_start_requested) {
			rc = esp_wifi_stop();
			if (rc)
				break;
			s31_wifi_start_requested = 0;
			s31_wifi_start_complete = 0;
		}
		rc = esp_wifi_set_mode(WIFI_MODE_APSTA);
		if (rc)
			break;
		memcpy(config.ap.ssid, request->ssid, request->ssid_length);
		config.ap.ssid_len = request->ssid_length;
		config.ap.channel = request->channel;
		config.ap.ssid_hidden = request->hidden;
		config.ap.max_connection = request->max_connections;
		config.ap.beacon_interval = request->beacon_interval;
		config.ap.dtim_period = request->dtim_period;
		config.ap.authmode = WIFI_AUTH_OPEN;
		if (request->has_psk) {
			for (i = 0; i < 32; i++) {
				config.ap.password[2 * i] = hex[request->psk[i] >> 4];
				config.ap.password[2 * i + 1] = hex[request->psk[i] & 15];
			}
			config.ap.authmode = WIFI_AUTH_WPA2_PSK;
		} else if (request->password_length) {
			memcpy(config.ap.password, request->password, request->password_length);
			config.ap.authmode = WIFI_AUTH_WPA3_PSK;
			config.ap.pmf_cfg.required = true;
			config.ap.sae_pwe_h2e = WPA3_SAE_PWE_BOTH;
		}
		rc = esp_wifi_set_mac(WIFI_IF_AP, request->mac);
		if (!rc)
			rc = esp_wifi_set_config(WIFI_IF_AP, &config);
		s31_wifi_ap_ready = 0;
		if (!rc)
			rc = esp_wifi_start();
		if (!rc) {
			s31_wifi_start_requested = 1;
			for (i = 0; i < 200 && !s31_wifi_ap_ready; i++)
				vTaskDelay(pdMS_TO_TICKS(10) ?: 1);
			if (s31_wifi_ap_ready != 1)
				rc = ESP_ERR_TIMEOUT;
		}
		s31_wifi_ap_active = !rc;
		if (rc) {
			esp_wifi_stop();
			esp_wifi_set_mode(WIFI_MODE_STA);
			s31_wifi_start_requested = 0;
			s31_wifi_start_complete = 0;
		}
		break;
	case S31_WIFI_AP_STOP:
		rc = esp_wifi_set_mode(WIFI_MODE_STA);
		if (!rc)
			s31_wifi_ap_active = false;
		break;
	case S31_WIFI_AP_DEAUTH: {
		uint16_t aid = 0;
		bool all = true;

		for (i = 0; i < 6; i++)
			all &= request->mac[i] == 0xff;
		if (!all)
			rc = esp_wifi_ap_get_sta_aid(request->mac, &aid);
		if (!rc)
			rc = esp_wifi_deauth_sta(aid);
		break;
	}
	case S31_WIFI_MONITOR_START:
		if (!s31_wifi_start_requested) {
			rc = esp_wifi_start();
			if (!rc)
				s31_wifi_start_requested = 1;
		}
		if (!rc)
			rc = esp_wifi_set_promiscuous_rx_cb(s31_wifi_monitor_rx);
		if (!rc)
			rc = esp_wifi_set_promiscuous(true);
		break;
	case S31_WIFI_MONITOR_STOP:
		rc = esp_wifi_set_promiscuous(false);
		if (!rc)
			rc = esp_wifi_set_promiscuous_rx_cb(NULL);
		break;
	case S31_WIFI_SET_CHANNEL:
		if (request->channel < 1 || request->channel > 13)
			rc = ESP_ERR_INVALID_ARG;
		else {
			if (!s31_wifi_start_requested) {
				rc = esp_wifi_start();
				if (!rc)
					s31_wifi_start_requested = 1;
			}
			if (!rc)
				rc = esp_wifi_set_channel(request->channel, WIFI_SECOND_CHAN_NONE);
		}
		break;
	default:
		rc = ESP_ERR_NOT_SUPPORTED;
		break;
	}
done:
	s31_radio_wifi_control_complete(rc);
}
#endif

void s31_radio_stack_task(void *arg)
{
	wifi_init_config_t wifi_cfg = WIFI_INIT_CONFIG_DEFAULT();
	uintptr_t features = (uintptr_t)arg;
	bool enable_wifi = (features & S31_RADIO_FEATURE_WIFI) != 0;
#ifndef S31_WIFI_ONLY
	esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
	bool enable_bt = (features & S31_RADIO_FEATURE_BLUETOOTH) != 0;
#endif
	int rc;

	pmu_init();
	rc = s31_radio_clock_handoff();
	if (rc != 0) {
		s31_linux_printf("[S31] clock handoff rc=%d\n", rc);
		#ifdef S31_LINUX_SMODE
		if (enable_wifi)
			s31_radio_report_wifi_init(rc);
		#ifndef S31_WIFI_ONLY
		if (enable_bt)
			s31_radio_report_bt_init(rc);
		#endif
		#endif
		return;
	}
	if (s31_linux_pmu_reclaim_after_radio_init)
		s31_linux_pmu_reclaim_after_radio_init();
	/* ESP-IDF otherwise writes directly to UART0, bypassing Linux console log
	 * levels and corrupting interactive applications such as esp32-config.
	 * Route it through printk so diagnostics remain in dmesg while Linux owns
	 * whether they are shown on the serial console.  This also keeps the blob
	 * out of the ROM UART busy-poll path. */
	esp_log_set_vprintf(s31_radio_log_vprintf);
	esp_log_level_set("*", ESP_LOG_WARN);
	/* Keep the explicit native-IDF coexistence baseline.  The larger Linux
	 * direct-netdev values (32 static + 48 dynamic) reserve roughly 80 KiB of
	 * radio heap/DMA state, but did not eliminate the Type-2 LMAC stalls during
	 * A2DP traffic.  Matching the IDF 10 + 32 policy both frees that pressure
	 * and makes the throughput comparison meaningful. */
	wifi_cfg.static_rx_buf_num = 10;
	wifi_cfg.dynamic_rx_buf_num = 32;
	/* Keep the native 11n receive aggregation path.  The Linux esp_timer shim
	 * supplies the BlockAck reorder timeout and safely handles timer deletion
	 * from callbacks. */
	wifi_cfg.ampdu_rx_enable = 1;
	/* Keep IDF's TX aggregation path in both single-radio profiles.  Disabling
	 * it only for Wi-Fi+BT makes TCP ACK completions take seconds while the
	 * controller is enabled, even though the Linux enqueue path is healthy. */
	wifi_cfg.ampdu_tx_enable = 1;
	/* TX buffer type/number follows sdkconfig.radio.defaults.  Static TX
	 * avoids per-frame alloc/free churn but 16 buffers was too small for the
	 * BT+WiFi ACK stream (esp_wifi_internal_tx rc=257); keep dynamic TX for
	 * now while the TX completion stall is debugged. */
	/* BA12 repeatedly stopped TCP receive after 0.75--3.5 MiB on this AP even
	 * though the station remained associated.  BA6 completed full 50 MiB runs
	 * and is also ESP-IDF's default without PSRAM-backed Wi-Fi allocations. */
	wifi_cfg.rx_ba_win = 6;
	/* TX_BA_WIN is a compile-time Kconfig, set via CONFIG_ESP_WIFI_TX_BA_WIN.
	 * Keep the TX completion path healthy: shrinking TX buffers to 8 stalled
	 * the download (rc=257) under ACK bursts. */
	/* Re-register the OS adapter and rebuild the ROM callback dispatch table for
	 * the relocated Linux module.  Both pointers live in retained HP SRAM.  The
	 * dispatch table contains coex_core_* function addresses from the previous
	 * boot image, so retaining it would mix boot-firmware callbacks with the
	 * Linux-owned coexistence environment. */
	g_coa_funcs_p = NULL;
	coexist_funcs = NULL;
	if (enable_wifi) {
		rc = psa_crypto_init();
		s31_linux_printf("[S31] psa_crypto_init rc=%d\n", rc);
		if (rc != 0) {
			#ifdef S31_LINUX_SMODE
			s31_radio_report_wifi_init(rc);
			#endif
			return;
		}
		/* Keep the closed Wi-Fi library away from the M-mode CLIC window. */
		g_osi_funcs_p = NULL;
		g_wifi_osi_funcs._set_intr = s31_wifi_set_intr;
		g_wifi_osi_funcs._set_isr = s31_wifi_set_isr;
		g_wifi_osi_funcs._ints_on = s31_wifi_ints_on;
		g_wifi_osi_funcs._ints_off = s31_wifi_ints_off;
		g_wifi_osi_funcs._is_from_isr = s31_wifi_is_from_isr;
		/* Linux owns flash/MTD; do not let the IDF blob open its NVS backend. */
		wifi_cfg.nvs_enable = 0;
	}
	/* Replace the loader/FreeRTOS callbacks retained by the COEX ROM. */
	rc = esp_coex_adapter_register(&g_coex_adapter_funcs);
	if (rc != 0) {
		s31_linux_printf("[S31] esp_coex_adapter_register rc=%d\n", rc);
		#ifdef S31_LINUX_SMODE
		if (enable_wifi)
			s31_radio_report_wifi_init(rc);
		#ifndef S31_WIFI_ONLY
		if (enable_bt)
			s31_radio_report_bt_init(rc);
		#endif
		#endif
		return;
	}
	/*
	 * ESP-IDF normally performs these two calls together from its
	 * SECONDARY system-init hook.  Registering the adapter alone leaves
	 * the coexistence lock/environment uninitialised; esp_wifi_init() then
	 * faults as soon as it registers its scheduler callbacks.
	 */
	rc = coex_pre_init();
	s31_linux_printf("[S31] coex_pre_init rc=%d\n", rc);
	if (rc != 0) {
		#ifdef S31_LINUX_SMODE
		if (enable_wifi)
			s31_radio_report_wifi_init(rc);
		#ifndef S31_WIFI_ONLY
		if (enable_bt)
			s31_radio_report_bt_init(rc);
		#endif
		#endif
		return;
	}
	if (enable_wifi) {
		/* ESP-IDF creates the default event loop before initialising Wi-Fi. */
		rc = esp_event_loop_create_default();
		if (rc == 0)
			rc = esp_wifi_init(&wifi_cfg);
		s31_linux_printf("[S31] esp_wifi_init rc=%d\n", rc);
		#ifdef S31_LINUX_SMODE
		if (rc == 0)
			rc = esp_event_handler_register(WIFI_EVENT,
							ESP_EVENT_ANY_ID,
							s31_wifi_event, NULL);
		s31_radio_report_wifi_init(rc);
		#else
		if (rc == 0) {
			rc = esp_wifi_set_mode(WIFI_MODE_STA);
			s31_linux_printf("[S31] esp_wifi_set_mode rc=%d\n", rc);
			if (rc == 0) {
				rc = esp_wifi_start();
				s31_linux_printf("[S31] esp_wifi_start rc=%d\n", rc);
			}
		}
		#endif
		if (rc != 0)
			return;
	} else {
		#ifdef S31_LINUX_SMODE
		s31_radio_report_wifi_init(0);
		#endif
	}

