PuceBaboon/esp32-s31-linux/firmware/radio/radio_stack.c
#ifndef S31_WIFI_ONLY
	if (!enable_bt) {
		#ifdef S31_LINUX_SMODE
		s31_radio_report_bt_init(0);
		#endif
		return;
	}
	/* Keep IDF's configured S31 main-XTAL default of 100 kHz (40 MHz / 400).
	 * Do not call btdm_lp_set_lpclk_src() here: that API changes only the
	 * source.  It leaves btdm_lp.c's cached frequency at zero and also makes
	 * btdm_lp_timer_clk_init() skip the configuration path which fills it in,
	 * so the closed controller is told that its sleep RTC runs at 0 Hz. */
	rc = esp_bt_controller_init(&bt_cfg);
	s31_linux_printf("[S31] esp_bt_controller_init rc=%d\n", rc);
	#ifdef S31_LINUX_SMODE
	s31_radio_report_bt_init(rc);
	#endif
	if (rc == 0) {
	#ifndef S31_LINUX_SMODE
		rc = esp_bt_controller_enable(BTDM_CONTROLLER_MODE_EFF);
		s31_linux_printf("[S31] esp_bt_controller_enable rc=%d\n", rc);
	#endif
	}
#endif

}

/* Linux installs the deferred CLIC route only after the init task has
 * blocked/deleted and returned control to its worker.  Controller enable is
 * therefore a distinct second-stage task. */
void s31_radio_bt_enable_task(void *arg)
{
#ifdef S31_WIFI_ONLY
	(void)arg;
#else
	int rc;

	(void)arg;
	s31_rtos_use_internal_stacks();
	rc = esp_bt_controller_enable(BTDM_CONTROLLER_MODE_EFF);
	s31_linux_printf("[S31] esp_bt_controller_enable rc=%d\n", rc);
	/* The second coex_enable() synchronously invokes Wi-Fi's registered start
	 * callback.  pm_on_coex_start() already restarts the Wi-Fi coexistence
	 * scheduler; restarting the closed coexist core again here corrupts that
	 * freshly selected phase and can starve Wi-Fi while BTDM is idle. */
	#ifdef S31_LINUX_SMODE
	if (rc == 0) {
		rc = esp_vhci_host_register_callback(&s31_vhci_callbacks);
		s31_linux_printf("[S31] esp_vhci_host_register_callback rc=%d\n", rc);
	}
	s31_radio_report_bt_enable(rc);
	s31_radio_heap_report("after-bt-enable");
	#endif
#endif
}

void s31_radio_bt_disable_task(void *arg)
{
#ifdef S31_WIFI_ONLY
	(void)arg;
#else
	int rc;

	(void)arg;
	s31_rtos_use_internal_stacks();
	rc = esp_bt_controller_disable();
	s31_linux_printf("[S31] esp_bt_controller_disable rc=%d\n", rc);
#ifdef S31_LINUX_SMODE
	s31_radio_heap_report("after-bt-disable");
	s31_radio_report_bt_disable(rc);
#endif
#endif
}

void s31_radio_shutdown_task(void *arg)
{
	uintptr_t features = (uintptr_t)arg;
	int result = 0;
	int rc;

#ifndef S31_WIFI_ONLY
	if (features & S31_RADIO_FEATURE_BLUETOOTH) {
		rc = esp_bt_controller_disable();
		if (rc != 0 && rc != ESP_ERR_INVALID_STATE && !result)
			result = rc;
		s31_linux_printf("[S31] shutdown bt disable rc=%d\n", rc);
		rc = esp_bt_controller_deinit();
		if (rc != 0 && rc != ESP_ERR_INVALID_STATE && !result)
			result = rc;
		s31_linux_printf("[S31] shutdown bt deinit rc=%d\n", rc);
	}
#endif
	if (features & S31_RADIO_FEATURE_WIFI) {
		esp_event_handler_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID,
					     s31_wifi_event);
		esp_wifi_disconnect();
		rc = esp_wifi_stop();
		if (rc != 0 && rc != ESP_ERR_WIFI_NOT_INIT && !result)
			result = rc;
		s31_linux_printf("[S31] shutdown wifi stop rc=%d\n", rc);
		rc = esp_wifi_deinit();
		if (rc != 0 && rc != ESP_ERR_WIFI_NOT_INIT && !result)
			result = rc;
		s31_linux_printf("[S31] shutdown wifi deinit rc=%d\n", rc);
		esp_event_loop_delete_default();
		/* The next module instance may initialize Wi-Fi after BT has used the
		 * shared modem domain.  IDF resets WIFIMAC on the init path, but an
		 * explicit post-deinit reset also clears retained TX/RX state before
		 * the Linux module and its interrupt mappings disappear.  Without it,
		 * a Wi-Fi -> BT -> Wi-Fi lifecycle can associate while the second
		 * radio worker never observes the queued DHCP frames. */
		modem_clock_module_mac_reset(S31_PERIPH_WIFI_MODULE);
		s31_linux_printf("[S31] shutdown wifi MAC reset\n");
	}
#ifdef S31_LINUX_SMODE
	s31_radio_report_shutdown(result);
#endif
}
